In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
from env import host, user, password

### Obtain connection to database and create SQL queries.

In [7]:
def get_db_url(username, password, hostname, database):
    
    return f'mysql+pymysql://{username}:{password}@{hostname}/{database}'

In [14]:
url_employees = get_db_url(user, password, host, 'employees')

In [11]:
sql_employees = '''
        select * from employees;
'''

sql_titles = '''
        select * from titles;
'''

### Read the employees and titles tables into two separate DataFrames

In [15]:
employees_df = pd.read_sql(sql_employees, url)
titles_df = pd.read_sql(sql_titles, url)

In [ ]:
# Running this line of code will cache the employees dataframe 
# employees_df.to_csv('employees')

In [19]:
employees_df

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [20]:
titles_df

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

#### How many rows and columns do you have in each DataFrame? Is that what you expected?

In [ ]:
employees_df.info()

In [ ]:
titles_df.info()

### Display the summary statistics for each DataFrame.

In [ ]:
employees_df.describe().T

In [ ]:
titles_df.describe().T

### How many unique titles are in the titles DataFrame?

In [ ]:
titles_df.title.value_counts()

### What is the oldest date in the to_date column?

In [ ]:
titles_df.to_date.sort_values()

### What is the most recent date in the to_date column?

In [ ]:
titles_df.to_date.sort_values(ascending=False)

### Create 'users' and 'roles' dataframes.

In [ ]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})

# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})

### What is the result of using a right join on the dataframes?

In [ ]:
pd.merge(users, roles, on='id', how='right')

### What is the result of using an outer join on the dataframes?

In [ ]:
pd.merge(users, roles, on="id", how="outer")

### What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [ ]:
pd.merge(users,roles, how='outer')

In [ ]:
# Load the mpg dataset from PyDataset.
from pydataset import data
mpg = data('mpg')

In [ ]:
mpg

### Output and read the documentation for the mpg dataset.

In [ ]:
data('mpg', show_doc=True)

### How many rows and columns are in the dataset?

In [ ]:
mpg.info()

### Check out your column names and perform any cleanup you may want on them.

In [ ]:
mpg.rename(columns={'displ':'engine_displacement', 'cyl':'cylinder','trans':'transmission_type','drv':'drive_type','cty':'city_mpg','hwy':'highway_mpg'}, inplace=True)

In [ ]:
mpg

### Display the summary statistics for the dataset.

In [ ]:
mpg.describe().T

### How many different manufacturers are there?

In [ ]:
mpg.manufacturer.value_counts()

In [ ]:
len(mpg.manufacturer.value_counts())

### How many different models are there?

In [ ]:
mpg.model.value_counts()

In [ ]:
len(mpg.model.value_counts())

### Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [ ]:
mpg['mileage_difference'] = mpg.highway_mpg - mpg.city_mpg

In [ ]:
mpg

### Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [ ]:
mpg['average_mileage'] = (mpg.highway_mpg + mpg.city_mpg)/2

In [ ]:
mpg

### Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [ ]:
mpg['is_automatic'] = mpg['transmission_type'].str.contains('auto')

In [ ]:
mpg

### Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [ ]:
mpg.groupby('manufacturer').average_mileage.mean().sort_values(ascending=False)

### Do automatic or manual cars have better miles per gallon?

In [ ]:
mpg.groupby('is_automatic').average_mileage.mean()

### Use your get_db_url function to help you explore the data from the chipotle database.

In [22]:
sql_query_chipotle = '''
        select * from orders;
'''
url_chipotle = get_db_url(user, password, host, 'chipotle')

In [23]:
chipotle = pd.read_sql(sql_query_chipotle, url_chipotle)

In [24]:
chipotle

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

### What is the total price for each order?

In [29]:
chipotle.groupby('order_id').item_price.sum()

order_id
1       $2.39 $3.39 $3.39 $2.39
2                        $16.98
3                  $10.98 $1.69
4                  $11.75 $9.25
5                   $9.25 $4.45
                  ...
1830              $11.75 $11.25
1831          $9.25 $2.15 $1.50
1832                $8.75 $4.45
1833              $11.75 $11.75
1834         $11.25 $8.75 $8.75
Name: item_price, Length: 1834, dtype: object

In [30]:
# applies lambda to values in item_price 
# lambda removes the first chatacter and leading and trailing white space in the string
# it then converts the value to a float

chipotle['item_price'] = chipotle.item_price.apply(lambda value: float(value[1:].strip()))

In [37]:
chipotle

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,2.39
1,2,1,1,Izze,[Clementine],3.39
2,3,1,1,Nantucket Nectar,[Apple],3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98
...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",8.75

In [44]:
chipotle.groupby('order_id').item_price.sum()

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: item_price, Length: 1834, dtype: float64

### What are the most popular 3 items?

In [48]:
chipotle.item_name.value_counts().head(3)

Chicken Bowl           726
Chicken Burrito        553
Chips and Guacamole    479
Name: item_name, dtype: int64

### Which item has produced the most revenue?

In [49]:
chipotle.groupby('item_name').item_price.sum().sort_values(ascending=False).head(1)

item_name
Chicken Bowl    7342.73
Name: item_price, dtype: float64

### Join the employees and titles DataFrames together.

In [52]:
employee_title = pd.merge(employees_df, titles_df, how='inner')

In [53]:
employee_title

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01
...,...,...,...,...,...,...,...,...,...
443303,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Engineer,1987-08-30,1992-08-29
443304,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Senior Engineer,1992-08-29,9999-01-01
443305,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Senior Staff,1998-12-27,9999-01-01
443306,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Staff,1993-12-27,1998-12-27
443307,499999,1958-05-01,Sachin,Tsukuda,M,1997-11-30,Engineer,1997-11-30,9999-01-01

### For each title, find the hire date of the employee that was hired most recently with that title.

In [55]:
employee_title.groupby('title').from_date.max().sort_values()

title
Manager               1996-08-30
Assistant Engineer    2000-02-01
Staff                 2000-02-01
Technique Leader      2000-02-01
Engineer              2002-08-01
Senior Engineer       2002-08-01
Senior Staff          2002-08-01
Name: from_date, dtype: object

### Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [58]:
query = '''

SELECT emp_no, title, dept_name

FROM employees
JOIN titles USING(emp_no)
JOIN dept_emp USING(emp_no)
JOIN departments USING(dept_no)

where titles.to_date = "9999-01-01"

'''

df = get_db_url(user, password, host, 'employees')

num_titles = pd.read_sql(query, df)

In [59]:
num_titles

        emp_no            title        dept_name
0        10001  Senior Engineer      Development
1        10002            Staff            Sales
2        10003  Senior Engineer       Production
3        10004  Senior Engineer       Production
4        10005     Senior Staff  Human Resources
...        ...              ...              ...
265327  499995         Engineer       Production
265328  499996  Senior Engineer       Production
265329  499997  Senior Engineer      Development
265330  499998     Senior Staff          Finance
265331  499999         Engineer       Production

[265332 rows x 3 columns]

In [60]:
pd.crosstab(num_titles.title, num_titles.dept_name)

dept_name,Customer Service,Development,Finance,Human Resources,Marketing,Production,Quality Management,Research,Sales
title,,,,,,,,,
Assistant Engineer,68,1833,0,0,0,1542,433,77,0
Engineer,627,15677,0,0,0,13325,3744,830,0
Manager,1,1,1,1,1,1,1,1,1
Senior Engineer,1790,43364,0,0,0,37156,10390,2250,0
Senior Staff,12349,1085,10650,10843,12371,1123,0,10219,32032
Staff,3902,315,3199,3416,3880,349,0,3206,9967
Technique Leader,241,6117,0,0,0,5210,1422,321,0